import pandas as pd
import pytest


@pytest.fixture()
def empty_df():
    em_df = pd.DataFrame(
        {
            "Дата операции": [],
            "Дата платежа": [],
            "Номер карты": [],
            "Статус": [],
            "Сумма операции": [],
            "Валюта операции": [],
            "Сумма платежа": [],
            "Валюта платежа": [],
            "Кэшбэк": [],
            "Категория": [],
            "МСС": [],
            "Описание": [],
            "Бонусы (включая кэшбэк)": [],
            "Округление на инвесткопилку": [],
            "Сумма операции с округлением": [],
        }
    )
    return em_df


@pytest.fixture()
def transactions_df():
    df = pd.DataFrame(
        {
            "Дата платежа": ["01.08.2024", "19.07.2024", "20.06.2024", "31.12.2019", "31.12.2018"],
            "Сумма операции": ["-160.89", "-64.0", "-4575.45", "-17000.0", "-5.05"],
            "Категория": ["Супермаркеты", "Супермаркеты", "Фастфуд", "Супермаркеты", "Переводы"],
        }
    )
    return df


@pytest.fixture()
def transactions_df_test():
    df = pd.DataFrame({
        "Номер карты": ["1234567890123456", "1234567890123456", "9876543210987654"],
        "Сумма операции": [-100.5, -200.75, -50.25]
    })
    return df


@pytest.fixture()
def transactions_top():
    data = {
        "Дата платежа": ["2023-12-01", "2023-12-02", "2023-12-03", "2023-12-04", "2023-12-05"],
        "Сумма платежа": [100, 500, 200, 300, 400],
        "Категория": ["Продукты", "Транспорт", "Шоппинг", "Развлечения", "Продукты"],
        "Описание": ["Покупка еды", "Бензин", "Одежда", "Кино", "Фрукты"]
    }
    df = pd.DataFrame(data)
    return df


@pytest.fixture
def sample_data():
    return pd.DataFrame({
        "Дата платежа": ["2023-12-01", "2023-12-05", "2023-12-10"],
        "Сумма платежа": [500, 1500, 1000],
        "Категория": ["Еда", "Одежда", "Транспорт"],
        "Описание": ["Покупка еды", "Покупка куртки", "Поездка на такси"]
    })
